{
  "reports": [
    {
      "user_id": 1,
      "image_url": "/uploads/ec8b6af2-60ee-4798-80df-5c668b6e8986.jpg",
      "address": "5, улица Ткачева, Усольский, Павлодар, Павлодар Г.А., Павлодарская область, 140007, Казахстан",
      "longitude": 76.9449932,
      "generated_description": "Обращаюсь к акимату с просьбой рассмотреть возможность установки искусственных неровностей (лежачих полицейских) на пешеходных переходах по улице Ткачева. Это обусловлено тем, что дети регулярно переходят дорогу по пути в школу, а некоторые водители не соблюдают скоростной режим, что создает угрозу их безопасности. Кроме того, прошу рассмотреть вопрос о запрете парковки автомобилей вдоль данной дороги. Припаркованные транспортные средства существенно ограничивают видимость для пешеходов, вынуждая их выходить на проезжую часть, чтобы убедиться в отсутствии приближающегося транспорта, что также создает аварийные ситуации.",
      "priority": "high",
      "created_at": "2025-12-11T22:18:04",
      "original_description": "Здравствуйте! Прошу у акимата установить лежачих полицейских на пешеходах по Ткачева. Дети переходят дорогу в школу, некоторые машины не сбавляют скорость. Также просьба не разрешать парковать машин вдоль дороги, из-за чего закрывается обзор. Не видно машин которые едут, приходится выходить на дорогу чтобы увидеть машина едет или нет.",
      "id": 5,
      "latitude": 52.2521629,
      "title": "Безопасность пешеходов: лежачие полицейские и парковка на Ткачева",
      "category": "Дефекты дорог и тротуаров",
      "status": "received",
      "updated_at": "2025-12-11T22:18:13"
    },
    {
      "user_id": 1,
      "image_url": "/uploads/5a2a8c62-4e5e-4180-96c7-a4cfe0d85d49.jpg",
      "address": "113, улица Абая, Южный, Павлодар, Павлодар Г.А., Павлодарская область, 140001, Казахстан",
      "longitude": 76.9552077,
      "generated_description": "На пересечении улиц Абая, 113 и Естая обнаружен открытый колодец. Крышка колодца была повреждена грузовиком КамАЗ, предположительно, во время строительных работ на соседнем объекте. Требуется немедленное ограждение и ремонт для обеспечения безопасности пешеходов и транспортных средств.",
      "priority": "critical",
      "created_at": "2025-12-11T22:17:11",
      "original_description": "Абая 113 угол естая. Открыт колодец. Строится рядом дом камаз пробил крышку колодца",
      "id": 4,
      "latitude": 52.2814543,
      "title": "Открытый колодец на Абая 113: повреждение грузовиком",
      "category": "Открытые люки и засоры ливнёвки",
      "status": "received",
      "updated_at": "2025-12-11T22:17:17"
    },
    {
      "user_id": 1,
      "image_url": "/uploads/a69f4427-bdbe-4513-9ccc-90c3209a4a8c.jpg",
      "address": "160, улица Камзина, Горторг, Павлодар, Павлодар Г.А., Павлодарская область, 140001, Казахстан",
      "longitude": 76.9838368,
      "generated_description": "Просим рассмотреть возможность установки дополнительных урн для мусора на автобусной остановке «Камзина», расположенной по улице Ломова. В настоящее время на данной остановке отсутствуют урны, что приводит к скоплению бытовых отходов и ухудшению санитарно-экологического состояния прилегающей территории. Установка урн необходима для поддержания чистоты и порядка, а также для комфорта пассажиров, ожидающих транспорт.",
      "priority": "medium",
      "created_at": "2025-12-11T22:16:21",
      "original_description": "Добрый день! Пожалуйста поставьте урны на остановке. Конкретно эта остановка «Камзина» по ул. Ломова",
      "id": 3,
      "latitude": 52.2658905,
      "title": "Установка урн на автобусной остановке «Камзина»",
      "category": "Мусор и отходы",
      "status": "received",
      "updated_at": "2025-12-11T22:16:26"
    },
    {
      "user_id": 1,
      "image_url": "/uploads/b01db8c7-14bd-4e47-bed3-18be9c1b88bd.jpg",
      "address": "улица Катаева, Сарыарка, Павлодар, Павлодар Г.А., Павлодарская область, 140001, Казахстан",
      "longitude": 76.9749537,
      "generated_description": "Между домами по адресу Катаева, 14 и Катаева, 12 наблюдается серьезная проблема с утилизацией мусора. Мусорные баки переполнены, и вокруг них, а также по всей прилегающей территории, образовались большие скопления отходов. Несмотря на периодический вывоз мусора, жители продолжают выбрасывать его, что приводит к повторному образованию свалок. Зафиксировано появление крыс, которые свободно перемещаются по мусору, особенно вблизи дома Катаева, 12, создавая антисанитарные условия и угрозу здоровью. Необходимо принять меры для обеспечения постоянной чистоты и предотвращения накопления отходов на данной территории.",
      "priority": "high",
      "created_at": "2025-12-11T22:14:37",
      "original_description": "Здравствуйте между домом Катаева 14 и Катаева 12.. стоят мусорные бочки.лежит мусор горами вокруг бочков.. периодически его вывозят но жители вываливают вновь и вновь от валяется по всему двору!С Катаева 12 крысы ходят по этому мусору! На катаева 14 вроде сделали двор...но весь мусор валяется по всему двору!",
      "id": 2,
      "latitude": 52.2665978,
      "title": "Скопление мусора и крысы между домами Катаева 12 и 14",
      "category": "Мусор и отходы",
      "status": "received",
      "updated_at": "2025-12-11T22:14:44"
    },
    {
      "user_id": 1,
      "image_url": "/uploads/74370ed3-3538-4957-b44a-437f518ad41c.jpg",
      "address": "45, улица Лермонтова, Северный, Павлодар, Павлодар Г.А., Павлодарская область, 140006, Казахстан",
      "longitude": 76.9415279,
      "generated_description": "Уважаемые службы, сообщаем о наличии незакрепленной арматуры на углу улиц Лермонтова и Сатпаева, рядом с недавно высаженными елочками. Данная арматура представляет серьезную опасность, поскольку ежедневно в этом районе проходит большое количество детей, направляющихся в детский сад. Просим принять срочные меры по удалению или безопасному закреплению арматуры для предотвращения возможных травм.",
      "priority": "high",
      "created_at": "2025-12-11T22:13:43",
      "original_description": "Здравствуйте на углу Лермонтова и Сатпаева, возле россыпи алмазов посадили ёлочки, но арматуру так и не убрали, очень опасно там много деток проходит в садик",
      "id": 1,
      "latitude": 52.2900652,
      "title": "Опасная арматура возле ёлочек на Лермонтова-Сатпаева",
      "category": "Дефекты дорог и тротуаров",
      "status": "received",
      "updated_at": "2025-12-11T22:13:53"
    }
  ]
}