
{
  "reports": [
    {
    "image_url": "/uploads/741bfe19-cfb0-4f69-876c-538fe3f5bfa2.jpg",
    "user_id": 1,
    "address": "5, улица Ткачева, Усольский, Павлодар, Павлодар Г.А., Павлодарская область, 140007, Казахстан",
    "longitude": 76.9449932,
    "generated_description": "На улице Ткачева, в районе пешеходного перехода, которым регулярно пользуются дети для перехода дороги в школу, наблюдается систематическое нарушение скоростного режима водителями транспортных средств. Это создает серьезную угрозу безопасности пешеходов, особенно детей. Дополнительно, вдоль проезжей части постоянно паркуются автомобили, что значительно ограничивает видимость для пешеходов и водителей, выезжающих со второстепенных дорог или припаркованных мест. Из-за этого пешеходам приходится выходить на проезжую часть, чтобы оценить дорожную обстановку, что многократно повышает риск дорожно-транспортных происшествий. Прошу рассмотреть возможность установки искусственных неровностей (лежачих полицейских) на данном участке дороги и усилить контроль за соблюдением правил парковки для обеспечения безопасности всех участников дорожного движения.",
    "priority": "critical",
    "created_at": "2025-12-11T20:48:55",
    "original_description": "Здравствуйте! Прошу у акимата установить лежачих полицейских на пешеходах по Ткачева. Дети переходят дорогу в школу, некоторые машины не сбавляют скорость. Также просьба не разрешать парковать машин вдоль дороги, из-за чего закрывается обзор. Не видно машин которые едут, приходится выходить на дорогу чтобы увидеть машина едет или нет.",
    "id": 6,
    "latitude": 52.2521629,
    "title": "Повышение безопасности пешеходов у школы на улице Ткачева",
    "category": "Незаконная парковка и нарушения ПДД",
    "status": "received",
    "updated_at": "2025-12-11T20:49:08"
  },
  {
    "image_url": "/uploads/2d552da8-b076-49b2-9b32-b99ecd6bfb84.jpg",
    "user_id": 1,
    "address": "113, Абая, Экибастуз, Экибастуз городская администрация, Павлодарская область, S13M8C5, Казахстан",
    "longitude": 75.3300199,
    "generated_description": "На пересечении улиц Абая, 113 и Естая обнаружен открытый колодец. Причиной повреждения крышки колодца стал грузовик КамАЗ, участвующий в строительных работах на соседнем объекте. Данная ситуация представляет серьезную опасность для пешеходов и транспортных средств.",
    "priority": "critical",
    "created_at": "2025-12-11T20:46:22",
    "original_description": "Абая 113 угол естая. Открыт колодец. Строится рядом дом камаз пробил крышку колодца",
    "id": 5,
    "latitude": 51.7099118,
    "title": "Открытый колодец на Абая 113: повреждение крышки грузовиком",
    "category": "Открытые люки и засоры ливнёвки",
    "status": "received",
    "updated_at": "2025-12-11T20:46:28"
  },
  {
    "image_url": "/uploads/6e8bca3a-6d59-4cca-851b-028b0e0b0790.jpg",
    "user_id": 1,
    "address": "160, улица Камзина, Горторг, Павлодар, Павлодар Г.А., Павлодарская область, 140001, Казахстан",
    "longitude": 76.9838368,
    "generated_description": "На остановке общественного транспорта «Камзина», расположенной по улице Ломова, отсутствуют урны для мусора. Это приводит к скоплению отходов и нарушению чистоты прилегающей территории. Просим рассмотреть возможность установки необходимых урн для поддержания порядка и улучшения санитарного состояния данной общественной зоны.",
    "priority": "medium",
    "created_at": "2025-12-11T20:44:05",
    "original_description": "Добрый день! Пожалуйста поставьте урны на остановке. Конкретно эта остановка «Камзина» по ул. Ломова",
    "id": 4,
    "latitude": 52.2658905,
    "title": "Запрос на установку урн на остановке «Камзина»",
    "category": "Мусор и отходы",
    "status": "received",
    "updated_at": "2025-12-11T20:44:11"
  },
  {
    "image_url": "/uploads/3474ab14-ef01-4f4e-8384-7c04d00aef4d.jpg",
    "user_id": 1,
    "address": "12, М. М. Катаева улица, Теренколь, Теренкольский район, Павлодарская область, Казахстан",
    "longitude": 76.1040384,
    "generated_description": "Добрый день. Между домами по адресу Катаева, 14 и Катаева, 12 расположены мусорные контейнеры. Вокруг этих контейнеров постоянно образуются крупногабаритные скопления мусора. Несмотря на регулярный вывоз, жители продолжают выбрасывать отходы, что приводит к постоянному загрязнению всего дворового пространства. Отмечено появление крыс, которые передвигаются по мусорным завалам, особенно со стороны дома Катаева, 12. Двор у дома Катаева, 14, по всей видимости, был благоустроен, однако общее состояние двора ухудшается из-за разбросанного мусора. Требуется принять меры для решения проблемы с постоянным загрязнением и появлением грызунов.",
    "priority": "high",
    "created_at": "2025-12-11T20:40:36",
    "original_description": "Здравствуйте между домом Катаева 14 и Катаева 12.. стоят мусорные бочки.лежит мусор горами вокруг бочков.. периодически его вывозят но жители вываливают вновь и вновь от валяется по всему двору!С Катаева 12 крысы ходят по этому мусору! На катаева 14 вроде сделали двор...но весь мусор валяется по всему двору!",
    "id": 3,
    "latitude": 53.0758259,
    "title": "Мусорные завалы и крысы между домами Катаева 12 и 14",
    "category": "Мусор и отходы",
    "status": "in_process",
    "updated_at": "2025-12-11T20:40:42"
  },
  {
    "image_url": "/uploads/d6c092ed-eb10-485f-8d59-1418d58aa095.jpg",
    "user_id": 1,
    "address": "45, Лермонтова улица, Майкаин, Баянаульский район, Павлодарская область, 140308, Казахстан",
    "longitude": 75.7991461,
    "generated_description": "На пересечении улиц Лермонтова и Сатпаева, в районе инсталляции «Россыпи алмазов», были высажены молодые ели. Однако после проведения посадочных работ не была удалена торчащая арматура, что создает серьезную опасность. Данный участок является маршрутом для многих детей, направляющихся в детский сад. Требуется незамедлительное удаление опасной арматуры.",
    "priority": "critical",
    "created_at": "2025-12-11T20:38:13",
    "original_description": "Здравствуйте на углу Лермонтова и Сатпаева, возле россыпи алмазов посадили ёлочки, но арматуру так и не убрали, очень опасно там много деток проходит в садик",
    "id": 2,
    "latitude": 51.4649054,
    "title": "Опасная арматура возле саженцев на Лермонтова/Сатпаева",
    "category": "Аварийные деревья и зелёные насаждения",
    "status": "received",
    "updated_at": "2025-12-11T20:38:22"
  },
  {
    "image_url": "/uploads/2692f21c-f2d7-4d11-9733-3d73b1e9b9fe.jpg",
    "user_id": 1,
    "address": "45, Лермонтова улица, Майкаин, Баянаульский район, Павлодарская область, 140308, Казахстан",
    "longitude": 75.7991461,
    "generated_description": "Здравствуйте на углу Лермонтова и Сатпаева, возле россыпи алмазов посадили ёлочки, но арматуру так и не убрали, очень опасно там много деток проходит в садик",
    "priority": "medium",
    "created_at": "2025-12-11T20:31:45",
    "original_description": "Здравствуйте на углу Лермонтова и Сатпаева, возле россыпи алмазов посадили ёлочки, но арматуру так и не убрали, очень опасно там много деток проходит в садик",
    "id": 1,
    "latitude": 51.4649054,
    "title": "Новый отчет",
    "category": "Другое",
    "status": "received",
    "updated_at": "2025-12-11T20:31:45"
  }
]
}
